### 180309
p190~217 뒤에 pandas 더 있음
- 자느라 수업 타자X

p196
-

!conda install pandas-datareader
- 너무 오래걸리니 그냥 cmd에서

In [40]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [41]:
#corr, cov용 data.py
# c:\users\kitcoop\anaconda3\lib\site-packages\pandas_datareader
from pandas_datareader import data

In [43]:
data

In [44]:
#야후는 더이상 데이터 제공 X
all_data= {}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker]= data.DataReader(ticker, 'yahoo', '2015-01-01', '2016-01-01')

ImmediateDeprecationError:
Yahoo Daily has been immediately deprecated due to large breaks in the API without the
introduction of a stable replacement. Pull Requests to re-enable these data
connectors are welcome.

See https://github.com/pydata/pandas-datareader/issues

In [18]:
df= DataFrame([[1.,6.5,3.]
                ,[1.,np.nan,np.nan]
                ,[np.nan,np.nan,np.nan,np.nan]
                ,[np.nan,6.5,3.]])

In [19]:
df

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
df.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [21]:
df

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
#얕 복
df.fillna(0)

     0    1    2    3
0  1.0  6.5  3.0  0.0
1  1.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  6.5  3.0  0.0

In [25]:
df

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
df.fillna({1:0.5, 3:-1})

     0    1    2    3
0  1.0  6.5  3.0 -1.0
1  1.0  0.5  NaN -1.0
2  NaN  0.5  NaN -1.0
3  NaN  6.5  3.0 -1.0

#### 계층적색인

In [27]:
index_2D= ['a','a','a','b','b','b','c','c','d','d']
index_1D= [1,2,3,1,2,3,1,2,2,3]

data= Series(np.random.randn(10),
            index=[index_2D, index_1D])
data

a  1   -0.100721
   2   -0.573908
   3   -1.207219
b  1   -1.484197
   2    0.429879
   3    0.008645
c  1    0.062848
   2    0.924164
d  2    0.496290
   3   -0.487970
dtype: float64

In [28]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [29]:
data['b']

1   -1.484197
2    0.429879
3    0.008645
dtype: float64

In [32]:
data['b':'d']

b  1   -1.484197
   2    0.429879
   3    0.008645
c  1    0.062848
   2    0.924164
d  2    0.496290
   3   -0.487970
dtype: float64

In [31]:
data.loc[['b','d']]

b  1   -1.484197
   2    0.429879
   3    0.008645
d  2    0.496290
   3   -0.487970
dtype: float64

In [33]:
data[:,2]

a   -0.573908
b    0.429879
c    0.924164
d    0.496290
dtype: float64

##### .unstack()

In [35]:
data

a  1   -0.100721
   2   -0.573908
   3   -1.207219
b  1   -1.484197
   2    0.429879
   3    0.008645
c  1    0.062848
   2    0.924164
d  2    0.496290
   3   -0.487970
dtype: float64

In [37]:
uD= data.unstack(); uD

          1         2         3
a -0.100721 -0.573908 -1.207219
b -1.484197  0.429879  0.008645
c  0.062848  0.924164       NaN
d       NaN  0.496290 -0.487970

In [38]:
uD.stack()

a  1   -0.100721
   2   -0.573908
   3   -1.207219
b  1   -1.484197
   2    0.429879
   3    0.008645
c  1    0.062848
   2    0.924164
d  2    0.496290
   3   -0.487970
dtype: float64